#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_test.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=1ac4e892-f235-4a73-b135-0a405cc9a068]
module.keycloak_test.module.onestopauth.module.client_junminclienttest-100-67.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b62befee-13bf-43d9-b574-a31ce9685301]
module.keycloak_test.module.onestopauth.module.client_aug-17-test-email-596.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b4969680-f1bd-4168-b6c7-88335fb38b0f]
module.keycloak_test.module.onestopauth.module.client_aug-17-test-email-596.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=3f59bd00-3986-404a-956b-12c9d4bc0a2a]
module.keycloak_test.module.onestopauth.module.client_aug-17-test-email-596.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=1abddc22-2004-4541-ae56-b3d3043598d2]
module.keycloak_test.module.onestopauth.module.client_junminclienttest-100-67.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=4f3f5cd9-b6d2-42fd-bacb-efa12781f492]
module.keycloak_test.module.onestopauth.module.client_aug-17-test-email-596.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=a7e342e5-ee7d-40ba-aebe-c6ca3d5739f1]
module.keycloak_test.module.onestopauth.module.client_aug-17-test-email-596.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8b085dc0-1114-49fb-a5ef-b1bd11a9ad37]
module.keycloak_test.module.onestopauth.module.client_test-123-test-100.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=090e55a7-18a6-47ee-9e17-a82b4caf027a]
module.keycloak_test.module.onestopauth.module.client_test-123-test-100.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=d08825e9-85a3-4755-88da-afe13a24350e]
module.keycloak_test.module.onestopauth.module.client_test-123-test-100.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=75053f7b-d4a8-40be-94be-f076e16e22f5]
module.keycloak_test.module.onestopauth.module.client_test-123-test-100.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=81d24edc-5aa7-4abd-9e7e-63d34747aa6e]
module.keycloak_test.module.onestopauth.module.client_test-123-test-100.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=088bdf7a-077c-43b1-8798-34606ea46e7b]
module.keycloak_test.module.onestopauth.module.client_test-123-test-100.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=bd83e4ce-693a-4941-93dc-9c0ec3416e88]
module.keycloak_test.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7a053e7d-eb39-4181-aa3c-bd345eb19f83]
module.keycloak_test.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=851dcaf5-3f07-4ec0-a372-942d17f56886]
module.keycloak_test.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=776cb2be-c253-4aba-ab41-0d07c5304167]
module.keycloak_test.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=1466c781-a06b-4341-8609-2d6c8b094e4f]
module.keycloak_test.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=6ed554bd-d131-42db-a717-564e14e1d0d3]
module.keycloak_test.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=5bec41b7-7661-4f09-b338-fc300f3e515d]
module.keycloak_test.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=08fbb571-05b5-449d-9e2c-064fc7cf8f37]
module.keycloak_test.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ba3fd16f-02d2-4965-9d31-badd88b976dd]
module.keycloak_test.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=1595364b-a080-405b-b02f-f97ddf4eb323]
module.keycloak_test.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=832114ab-259e-4e33-aacf-439425098b6a]
module.keycloak_test.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=0e28276a-a47c-466a-9fae-a5c9ddcf731f]
module.keycloak_test.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=5e870995-8be2-4a6f-a474-00cd922d1e80]
module.keycloak_test.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=546c11d3-53bf-4cac-b41e-fc3f49395d92]
module.keycloak_test.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4c58385f-893b-4be9-844e-6552bb27e107]
module.keycloak_test.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f4c19b99-1b93-4b30-8459-dc5f67f09b5c]
module.keycloak_test.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d8518d23-4192-40f8-bf23-1913653d3f1c]
module.keycloak_test.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=a3f12175-e290-4ace-8766-fd2ada9df7ac]
module.keycloak_test.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=bed71036-9310-4a04-a93c-c9110accee57]
module.keycloak_test.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=17a040ea-2ad5-4f19-9409-7d3cbbd45c42]
module.keycloak_test.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=04063278-9a23-4d31-afd1-00ecc18bc09d]
module.keycloak_test.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=92e282b0-c5ef-441c-a41a-e1a62622eadb]
module.keycloak_test.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=99dc2e7d-7c85-42f9-abe7-b30465736841]
module.keycloak_test.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=34812da4-8682-4c47-bbb7-0be93e103bf5]
module.keycloak_test.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=4dd87ed1-cde7-438f-bc65-9cb1eb1c8801]
module.keycloak_test.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=10ed7f71-67d2-45cf-b179-5933d2c53d80]
module.keycloak_test.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=02095d74-4b80-44b3-8e4c-e79c5185999a]
module.keycloak_test.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d5b84701-21e3-47ee-8d1e-a79e5d82508b]
module.keycloak_test.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=0b5b31bf-dca4-4626-a6ac-ebca35088116]
module.keycloak_test.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=df8a8597-2661-46c5-8595-9369aa74c9de]
module.keycloak_test.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=ab44ffd7-f1dd-4ab3-8675-3d976a7854c8]
module.keycloak_test.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=30012bbe-3dbf-4a5b-95d3-f0828b00ea1c]
module.keycloak_test.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=1dd0a803-1faa-4f01-809a-4c82d3e267d5]
module.keycloak_test.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=58894161-338f-4b8b-8ca2-0bcd494ef5cb]
module.keycloak_test.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=5ccad9cc-a9c7-41fe-8cb8-4ef0ef5440bf]
module.keycloak_test.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=bb106d45-87f9-4bef-96b1-aec1da313533]
module.keycloak_test.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2e8f9fa0-bd63-42e3-b18e-c1fe89faec68]
module.keycloak_test.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=a2f017db-b2a3-4268-8eca-d00780a0fbee]
module.keycloak_test.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=a7bad6d8-cc3c-4763-bdbe-9cf77cf18e1f]
module.keycloak_test.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=eb404028-dc05-4845-ba5d-c639101b3d5b]
module.keycloak_test.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8107ee32-87f3-41eb-bb21-3df0944b94b8]
module.keycloak_test.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=41c46f80-61a5-491e-9fa7-1f9b07bb9e24]
module.keycloak_test.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=bec9b68d-164e-431a-9bf5-0561bf500918]
module.keycloak_test.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=95a80664-1e47-4a39-b50e-80213d5a4ec7]
module.keycloak_test.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a4038a18-7e89-4d5e-969f-c5d160540867]
module.keycloak_test.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=65ebcb36-21f5-4b3f-87ce-1f8c3041d1d1]
module.keycloak_test.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=d9e4c5ec-c3a3-4a06-82d7-e8e68d1e8236]
module.keycloak_test.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=73c0c364-21b0-4b46-a6d4-c3c890a1481d]
module.keycloak_test.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ea55037b-e1ef-488a-a9bb-369203ac1e54]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth.module.client_asdfsafa-1322.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_asdfsafa-1322.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_asdfsafa-1322.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_asdfsafa-1322.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "asdfsafa-1322"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_asdfsafa-1322.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_asdfsafa-1322.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_asdfsafa-1322.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "asdfsafa-1322"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "asdfsafa-1322"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://www.google.ca",
        ]
    }

  # module.keycloak_prod.module.onestopauth.module.client_asdfsafa-1322.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_asdfsafa-1322.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_asdfsafa-1322.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_asdfsafa-1322.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "asdfsafa-1322"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_asdfsafa-1322.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_asdfsafa-1322.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_asdfsafa-1322.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "asdfsafa-1322"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "asdfsafa-1322"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://www.google.ca",
        ]
    }

  # module.keycloak_test.module.onestopauth.module.client_asdfsafa-1322.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_asdfsafa-1322.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_asdfsafa-1322.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_asdfsafa-1322.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "asdfsafa-1322"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_asdfsafa-1322.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_asdfsafa-1322.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_asdfsafa-1322.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "asdfsafa-1322"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "asdfsafa-1322"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://www.google.ca",
        ]
    }

Plan: 21 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 1946 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*